{
  "streets": {
    "Coolsingel": {
      "description": "One of the main thoroughfares in Rotterdam, known for its historic buildings and proximity to landmarks like the Rotterdam City Hall. The street was heavily damaged during World War II but has since been rebuilt with a mix of old and new architecture."
    },
    "Lijnbaan": {
      "description": "This pedestrian street is famous for its modern shopping and commercial facilities. It was one of the first pedestrianized shopping streets in the Netherlands and is an example of post-war reconstruction."
    },
    "Beurstraverse": {
      "description": "A major shopping street in Rotterdam with a distinctive underground shopping area known as the 'Koopgoot.' It connects the Lijnbaan with the Coolsingel and is popular for shopping and dining."
    },
    "Witte de Withstraat": {
      "description": "Known for its vibrant cultural scene, this street is lined with trendy bars, restaurants, and art galleries. It's a popular spot for both locals and tourists looking to experience Rotterdam's nightlife and creative scene."
    },
    "Hofplein": {
      "description": "A major square and street in Rotterdam, it's known for its distinctive architecture and its role as a central transport hub in the city. The Hofplein is surrounded by notable buildings and landmarks."
    },
    "Schouwburgplein": {
      "description": "This square and street area is known for its cultural institutions, including the Rotterdamse Schouwburg (Rotterdam Theater). It's a central location for events and performances."
    },
    "Blaak": {
      "description": "An important street that runs through the heart of Rotterdam's business district and is home to iconic structures like the Cube Houses (Kubuswoningen) and the Markthal, a modern market hall with a striking design."
    },
    "Goudsesingel": {
      "description": "A major road in Rotterdam that runs along the old city boundary and is lined with various historic buildings and modern developments."
    },
    "West-Kruiskade": {
      "description": "Known for its diverse array of shops, restaurants, and cultural institutions. It reflects Rotterdam's multicultural aspect and offers a variety of international cuisines and shops."
    },
    "Kruiskade": {
      "description": "This street connects several important areas in Rotterdam and is known for its blend of commercial activity and residential buildings. It's also close to Rotterdam Central Station, making it a key transit route."
    },
    "Nieuwe Binnenweg": {
      "description": "A long street known for its eclectic mix of shops, cafes, and nightlife venues. It is a popular area for both shopping and entertainment."
    },
    "Westzeedijk": {
      "description": "A major road that runs along the edge of the city, offering views of the river and access to several parks and cultural institutions."
    },
    "Maasboulevard": {
      "description": "This scenic boulevard runs along the river, providing picturesque views of the water and the city's skyline. It's a popular spot for walking and cycling."
    },
    "Bergweg": {
      "description": "A busy street known for its variety of shops and restaurants, serving as a key commercial area in the northern part of the city."
    },
    "Vijverhofstraat": {
      "description": "Located in a trendy neighborhood, this street features a mix of creative businesses, cafes, and modern residential buildings."
    },
    "Mariniersweg": {
      "description": "A central road that connects several important areas in the city and is lined with various shops and businesses."
    },
    "Meent": {
      "description": "A vibrant street in the city center known for its fashion boutiques, restaurants, and bars. It's a popular destination for shopping and dining."
    },
    "Westerstraat": {
      "description": "A charming street in the historic Delfshaven district, known for its old-world architecture and picturesque canals."
    },
    "Oostzeedijk": {
      "description": "A significant road in the eastern part of the city, offering a mix of residential and commercial properties."
    },
    "Schiedamseweg": {
      "description": "A key street in the western part of the city, known for its diverse range of shops and cultural venues."
    },
    "Schiekade": {
      "description": "An important thoroughfare that connects several key areas in the city, featuring a mix of commercial and residential buildings."
    },
    "Weena": {
      "description": "A major street that runs through the heart of the city, known for its modern office buildings and proximity to the central train station."
    },
    "Eendrachtsweg": {
      "description": "A picturesque street in the city center, known for its historic buildings and scenic canal views."
    },
    "Mathenesserlaan": {
      "description": "A prominent street in the western part of the city, lined with impressive historic buildings and modern amenities."
    },
    "Bentincklaan": {
      "description": "Known for its beautiful tree-lined streets and mix of residential and commercial properties."
    },
    "Jonker Fransstraat": {
      "description": "A busy street with a variety of shops and services, serving as a key commercial area in the city."
    },
    "Proveniersstraat": {
      "description": "Located near the central train station, this street is known for its mix of residential buildings and small businesses."
    },
    "Eendrachtsplein": {
      "description": "A central square and street area known for its lively atmosphere and variety of cafes and restaurants."
    },
    "Schiemond": {
      "description": "A notable street in the harbor area, offering views of the river and access to several industrial and commercial facilities."
    },
    "Marconistraat": {
      "description": "Located in a vibrant neighborhood, known for its creative businesses and modern residential developments."
    },
    "Goudse Rijweg": {
      "description": "A significant road in the eastern part of the city, offering a mix of residential and commercial properties."
    },
    "Posthumalaan": {
      "description": "A major street in the southern part of the city, known for its modern office buildings and proximity to key landmarks."
    },
    "Wilhelminakade": {
      "description": "A scenic boulevard along the river, offering views of the water and access to several cultural institutions."
    },
    "Honingerdijk": {
      "description": "A picturesque street in the eastern part of the city, known for its historic buildings and scenic views."
    },
    "Zuidplein": {
      "description": "A major shopping and commercial area in the southern part of the city, known for its large mall and various amenities."
    },
    "Groene Hilledijk": {
      "description": "A key commercial street in the southern part of the city, offering a variety of shops and services."
    },
    "Oudedijk": {
      "description": "A notable street in the eastern part of the city, known for its mix of historic buildings and modern developments."
    },
    "Kralingseweg": {
      "description": "A significant road in the eastern part of the city, offering access to several parks and recreational areas."
    },
    "Admiraliteitskade": {
      "description": "A picturesque street along a canal, known for its historic buildings and scenic views."
    },
    "Lusthofstraat": {
      "description": "A popular shopping street in the eastern part of the city, known for its variety of stores and cafes."
    },
    "Benthuizerstraat": {
      "description": "A busy street with a variety of shops and services, serving as a key commercial area in the city."
    },
    "Witteveenweg": {
      "description": "Located in a vibrant neighborhood, known for its creative businesses and modern residential developments."
    },
    "Statenweg": {
      "description": "A major road in the northern part of the city, offering a mix of residential and commercial properties."
    },
    "Hoflaan": {
      "description": "A charming street in a historic neighborhood, known for its old-world architecture and picturesque views."
    },
    "Rochussenstraat": {
      "description": "A key street in the western part of the city, known for its diverse range of shops and cultural venues."
    },
    "Voorschoterlaan": {
      "description": "A significant road in the eastern part of the city, offering a mix of residential and commercial properties."
    }
  }
}
